project/atropos-go/etcd_concurrent_read-master/master/k150k_cancel/output/expensive_canceled_50ms/cheap_read.log
bench with linearizable range
 0 / 1000 B                                                                                                                                        !   0.00%INFO: 2023/06/12 14:32:30 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/12 14:32:30 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/12 14:32:30 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 1000 / 1000 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 10s

Summary:
  Total:	10.3035 secs.
  Slowest:	0.0514 secs.
  Fastest:	0.0002 secs.
  Average:	0.0009 secs.
  Stddev:	0.0042 secs.
  Requests/sec:	97.0540

Response time histogram:
  0.0002 [1]	|
  0.0053 [987]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0104 [3]	|
  0.0155 [0]	|
  0.0207 [0]	|
  0.0258 [0]	|
  0.0309 [0]	|
  0.0360 [1]	|
  0.0412 [4]	|
  0.0463 [0]	|
  0.0514 [4]	|

Latency distribution:
  10% in 0.0003 secs.
  25% in 0.0003 secs.
  50% in 0.0004 secs.
  75% in 0.0005 secs.
  90% in 0.0008 secs.
  95% in 0.0017 secs.
  99% in 0.0062 secs.
  99.9% in 0.0514 secs.